CREATE DATABASE java_labs;
USE java_labs;

CREATE TABLE `students` (
                            `id` int NOT NULL AUTO_INCREMENT,
                            `last_name` varchar(50) DEFAULT NULL,
                            `first_name` varchar(50) DEFAULT NULL,
                            `middle_name` varchar(50) DEFAULT NULL,
                            `birth_date` date DEFAULT NULL,
                            `student_id` int DEFAULT NULL,
                            `gradebook_id` int DEFAULT NULL,
                            PRIMARY KEY (`id`)
);

INSERT INTO `students` VALUES
                           (1,'Іванов','Іван','Іванович','2000-05-15',123456,1232312),
                           (2,'Петров','Петро','Петрович','2001-07-20',234567,2131213),
                           (3,'Сидоров','Олександр','Олександрович','1999-02-10',345678,4432232),
                           (4,'Коваленко','Марія','Володимирівна','2000-12-30',456789,5432423),
                           (5,'Павлюченко','Олег','Михайлович','2002-04-25',567890,6343422),
                           (6,'Василенко','Анна','Петрівна','2003-09-05',678901,6243236),
                           (7,'Лисенко','Катерина','Вікторівна','2001-11-12',789012,2131244),
                           (8,'Савченко','Андрій','Степанович','1998-08-03',890123,8675645),
                           (9,'Панченко','Марина','Ігорівна','2000-06-18',901234,3425673),
                           (10,'Григоренко','Ігор','Олегович','1999-03-22',112233,2354564),
                           (11,'Жуков','Сергій','Віталійович','2002-10-09',223344,5678346),
                           (12,'Морозова','Тетяна','Андріївна','2001-01-08',334455,3434787),
                           (13,'Кузнецов','Євген','Євгенович','1998-04-14',445566,3424562),
                           (14,'Сергієнко','Ольга','Юріївна','2002-07-29',556677,1234654),
                           (15,'Клименко','Максим','Валентинович','1999-09-16',667788,9808767),
                           (16,'Гончаренко','Віталій','Олександрович','2003-05-04',778899,3232457),
                           (17,'Бондаренко','Наталія','Іванівна','2000-08-28',889900,5454544),
                           (18,'Даниленко','Денис','Сергійович','1997-12-11',990011,2445677),
                           (19,'Мельник','Василь','Петрович','2001-03-26',112233,5454789),
                           (20,'Гаврилюк','Олена','Андріївна','1998-10-17',223344,9087776);